# Cenário: acesso ao sistema

- Setbit: serve para marcar valores do tipo booleanos. 
- 1, 2, 3 são os ids dos usuários que logaram no sistema
  
```
> SETBIT acesso:25-05-2015 15 1
(integer) 0
```

```
> GETBIT acesso:25-05-2015 15
(integer) 1
```

# Contando bits

```
> BITCOUNT acesso:25-06-2015
(integer) 2
> BITCOUNT acesso:26-06-2015
(integer) 2
> BITCOUNT acesso:27-06-2015
(integer) 3
```

# Operações - and

- Usuarios que acessaram o sistema mais de um dia. Preciso criar uma chave para a condição

```
> BITOP AND acesso:25-e-26-06-2015 acesso:25-06-2015 acesso:26-06-2015
(integer) 1

> GETBIT acesso:25-e-26-06-2015 1
(integer) 1
> GETBIT acesso:25-e-26-06-2015 2
(integer) 0
> GETBIT acesso:25-e-26-06-2015 3
(integer) 0

> BITCOUNT acesso:25-e-26-06-2015
(integer) 1

```

# Operações - or


```
> BITOP OR acesso:25-ou-26-06-2015 acesso:25-06-2015 acesso:26-06-2015

> GETBIT acesso:25-ou-26-06-2015 1
(integer) 1
> GETBIT acesso:25-ou-26-06-2015 2
(integer) 1
> GETBIT acesso:25-ou-26-06-2015 3
(integer) 1

> BITCOUNT acesso:25-ou-26-06-2015
(integer) 3
```