# Hash

- revisÃ£o e novos comandos

```
> HSET "jogador:1" nome "guilherme"
(integer) 1

> HSET "jogador:1" pontos 50076
(integer) 1

> HSET "jogador:2" nome "carlos"
(integer) 1

> HSET "jogador:2" pontos 76564
(integer) 1

> HGETALL "jogador:1"
1) "nome"
2) "guilherme"
3) "pontos"
4) "50076"

> HGETALL "jogador:2"
1) "nome"
2) "carlos"
3) "pontos"
4) "76564"

> HINCRBY "jogador:1" pontos 10
(integer) 50086

> HINCRBYFLOAT "jogador:1" pontos 10.5
"50096.5"
```